// 2. Задатак
// Написати програм који исписује дијамант са рупом за унето N: (Нема потребе проверавати улазне
// податке)
// Напомена: За пола поена, исписати горњи део слике (првих N редова, тј до реда који садржи
// празнину, укључујући њега)

// N = 5
//       *
//      ***
//     *****
//    *******
//   **** ****
//    *******
//     *****
//      ***
//       *

let n = 5
let j = 1
let k = 2*n-3
for (let i = 1; i < 2*n; i++) {
    if (i < n) {let red = "" + " ".repeat(n-i) + "*".repeat(j)
j += 2
console.log(red)}
    else if (i > n) {let red = "" + " ".repeat(i-n) + "*".repeat(k)
 k -= 2
 console.log(red)}
    else {let red = "*".repeat(n - 1) + " " + "*".repeat(n - 1)
console.log(red)}
 }